HELYXcore-4.4.0/examples/legacy/multiphase/interMixingFoam/laminar/damBreak/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
cp 0/alpha.air.orig 0/alpha.air
cp 0/alpha.other.orig 0/alpha.other
cp 0/alpha.water.orig 0/alpha.water
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
